import React, { ReactElement } from "react"
import { CommonLayout } from "@/components/Layouts"

// assets
import classes from '@/styles/InfoPage.module.scss'

export const AboutPage = () => {
  return (
    <>
      <div className={classes.content_wrapper}>
        <h1 className={classes.heading}>Компанія New Trans представляє</h1>
        <p>Ми займаємось пасажирськими перевезеннями Україною та за її межами. Працюємо на ринку цілодобово щодня протягом 6 років. За цей час компанія перетворилась на велику маршрутну мережу, а ми усвідомили: дорога не повинна втомлювати. З нами ви зможете потрапити в потрібне місто швидко, безпечно і комфортно.</p>
        <br/>
        <p>Наша перевага – індивідуальний підхід. Якщо у вас виникнуть питання з приводу розкладу і деталей маршруту, співробітники нашого Call-центра дадуть на них відповідь. Вони також будуть на звязку під час вашої подорожі. Затримуєтесь на посадку? – Ми вас чекаємо. Змінили плани і вирішили їхати іншим рейсом? – Ми перенесем ваш квиток.</p>
        <br/>
        <p>Нам важливо, як ви почуваєтесь в дорозі. На момент прибуття ваша шия і кінцівки не повинні затерпнути / змерзнути / спітніти чи бути кимось притиснутими. Для цього ми встановили зручні сидіння. Щоб дорога була приємнішою, в автобусі є кондиціонер і туалет. Ваші речі в багажному відділенні також почуватимуться комфортно.</p>
        <br/>
        <p>Ми розуміємо, як важливо мати можливість працювати дистанційно та відпочивати в дорозі. Тому в наших автобусах є відкритий WiFi. З нами ви закохаєтесь у шлях.</p>
      </div>
    </>
  )
}

AboutPage.getLayout = function getLayout(page: ReactElement) {
  return <CommonLayout>{page}</CommonLayout>
}

export default AboutPage
