import React, { ReactElement } from "react"
import { CommonLayout } from "@/components/Layouts"

// assets
import classes from '@/styles/InfoPage.module.scss'

export const PublicOfferPage = () => {
  return (
    <>
      <div className={classes.content_wrapper}>
        <h1 className={classes.heading}>ДОГОВІР ПУБЛІЧНОЇ ОФЕРТИ</h1>
        <p>Фізична особа-виконавець ФОП Станкова Лілія Сергіївна, що діє на підставі Виписки з ЄДР ЮО ФОП ГФ 3188018428 (далі – «Виконавець»), керуючись ст. 633. Цивільного кодексу України, пропонує необмеженому колу осіб (далі – «Користувач(і)») укласти Договір публічної оферти (далі – «Договір»), з метою пошуку та/або придбання квитків на сайті newtrans.com.ua (далі – «Сайт»).</p>
        <p>Користувач (Покупець) може діяти в межах Договору від свого імені та на свою користь та/або від імені третьої сторони та на її користь, у такому випадку Користувач діє виключно в межах повноважень, наданих третьою стороною.</p>
        <p>Квиток (у тому числі і електронний квиток) – проїзний документ встановленої форми, який дає право пасажиру на одержання транспортних послуг автобусного перевезення, створений в автоматизованій системі Виконавця, надсилається на електронну адресу, вказану при замовленні або іншим чином видається Користувачу.</p>
        <p>Номер квитка є номером договору публічної оферти і номером договору пасажирського перевезення.</p>
        <p>1. ПРЕДМЕТ ОФЕРТИ</p>
        <p>1.1. Предметом цієї Оферти є надання Виконавцем Користувачам послуг з бронювання, оформлення і продажу квитків на рейси та додаткові послуги (місця для багажа), що розташовані на сайті newtrans.com.ua, у відповідності до дати, часу та напрямку, обраного Користувачем.</p>
        <p>1.2. Виконавець не є агрегатом і реалізує квитки на рейси перевізників, які входять в групу перевізників компанії NewTrans.</p>
        <p>1.3. Продаж Квитків Покупцю, в тому числі Електронних квитків, проводиться виключно на умовах цієї Оферти і лише в разі повного і беззастережного прийняття умов цієї Оферти Покупцем (акцепту Оферти).</p>
        <p>2. ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН</p>
        <p>2.1. Користувач має право:</p>
        <p>2.1.1. Отримати послуги за Договором;</p>
        <p>2.1.2. Скористатись Квитком, у відповідності до обраної дати, часу, місця відправлення та обраного Перевізника;</p>
        <p>2.1.3. Повернути Квиток на умовах, визначених Виконавцем;</p>
        <p>2.1.4. Вимагати компенсації завданих збитків, згідно умов Договору, шляхом направлення відповідного звернення на адресу Виконавця;</p>
        <p>2.1.5. У випадку завдання моральної шкоди Користувачу, діями або бездіяльністю Виконавця, сума відшкодування, при її доведенні та обґрунтуванні не може перевищувати суму більшу чим вартість Квитка.</p>
        <p>2.2. Користувач зобов’язаний:</p>
        <p>2.2.1. Здійснити попередню оплату Квитка, у розмірі 100% вартості, що вказана на сайті;</p>
        <p>2.2.2. Перевірити дату, час, місто/місце відправлення, місто/місце прибуття одразу після придбання Квитка;</p>
        <p>2.2.3. Завчасно прибути до місця відправлення;</p>
        <p>2.2.4. Повідомити Виконавця про неможливість використання Квитка з тієї чи іншої причини;</p>
        <p>2.2.5. Ознайомитись з умовами повернення Квитка та правилами перевезення багажу;</p>
        <p>2.3. Виконавець має право:</p>
        <p>2.3.1. Діяти від імені Перевізника в межах повноважень, визначених договірними відносинами;</p>
        <p>2.3.2. Встановити та отримати додаткову винагороду з Користувача, за додатково надані сервіси та/або послуги;</p>
        <p>2.3.3. Записувати телефонні розмови з Користувачем та/або Пасажиром, у випадку звернення до сервісного центру та/або у випадку обслуговування Користувача/Пасажира, та/або необхідності повідомити Користувача/Пасажира, та/або отримати додаткові відомості щодо будь-якого Квитка, купівлю якого здійснено за допомогою Сайту.</p>
        <p>2.4. Виконавець зобов’язаний:</p>
        <p>2.4.1. Надіслати Користувачу Квиток відповідно до форми, встановленої і прийнятої Перевізником;</p>
        <p>2.4.2. Повідомити Користувача про зміни в умовах надання послуг;</p>
        <p>2.4.3. Повідомити Користувача про зміну або скасування рейсу;</p>
        <p>2.4.4. Прийняти звернення від Користувача, розглянути його самостійно або направити для розгляду відповідному Перевізнику;</p>
        <p>2.4.5. Своєчасно повідомити Користувача про розгляд звернення, а у випадку надсилання звернення Перевізнику про результати його розгляду (у випадку надходження такої відповіді на адресу Виконавеця);</p>
        <p>2.4.6. Надання відповіді на звернення здійснюється способом, аналогічним до його надходження. Надсилання відповіді третій стороні (у тому числі і за проханням Користувача) здійснюватися не буде.</p>
        <p>3. ВЗАЄМОРОЗРАХУНКИ</p>
        <p>3.1. Кошти, отримані від Користувача, в рахунок придбання Квитка, належать Виконавецю, в тому числі від Сервісного збору (у випадку, якщо такий входив до вартості Квитка).</p>
        <p>3.2. Користувач має право здійснити оплату Квитків будь-яким із способів, запропонованих Виконавцем, інформація про які знаходиться на Сайті.</p>
        <p>3.3. Користувач одноосібно відповідальний за всі комісійні витрати та інші визначені банком витрати, які можуть бути додані до ціни Квитка або додаткових послуг, емітентом кредитної або дебетної картки.</p>
        <p>3.4. Банківські послуги, пов’язані з переказом коштів в межах Договору, оплачуються Стороною, яка їх здійснює.</p>
        <p>4. ІДЕНТИФІКАЦІЯ КОРИСТУВАЧА</p>
        <p>4.1. В якості ідентифікатора Користувача використовується e-mail адреса та/або номер телефону, що вказується при придбанні Квитка.</p>
        <p>4.2. Звернення з номера телефона/e-mail адреси, залишеної при придбанні Квитка, дозволяє Виконавцю ідентифікувати Користувача, як належну Сторону Договору з відповідними правами та обов’язками, і дозволяє здійснювати дії по відношенню як до Договору загалом, так і до конкретно придбаного Квитка.</p>
        <p>4.3. Звернення Користувача з іншого номера телефона та/або e-mail адреси, наданого при придбанні Квитка, дає право Виконавцю вимагати від Користувача додатково ідентифікувати себе, як належну сторону Договору.</p>
        <p>4.4. У випадку неможливості ідентифікувати Користувача, як сторону Договору, Виконавець залишає за собою право відмовити у розгляді звернення.</p>
        <p>4.5. Відповідальність за збереження та/або доступ до номера телефона та/або e-mail адреси покладається на Користувача.</p>
        <p>5. УМОВИ ПОВЕРНЕННЯ КВИТКА</p>
        <p>5.1. Примусове повернення коштів за Квиток:</p>
        <p>5.1.1. У випадку повідомлення Перевізником про скасування рейсу, з тієї чи іншої причини, NewTrans здійснює повернення Коштів, отриманих в якості оплати Квитка, шляхом, яким вони надійшли у розмірі 100 % вартості Квитка, або, за наявності, пропонує інший Квиток на рейс того самого або іншого Перевізника.</p>
        <p>5.2. Добровільне повернення:</p>
        <p>5.2.1. У разі оформлення повернення Квитка за власної ініціативи Користувача, Агент повертає кошти Користувачу без повернення суми Сервісного збору. При поверненні квитка знімається наступний збір:</p>
        <p>- понад 72 годин до від'їзду – 10% від вартості квитка;</p>
        <p>- понад 24 години, але менше ніж 72 годин до від'їзду – 30% від вартості квитка;</p>
        <p>- менше ніж 24 години, але більше ніж 12 годин до від'їзду – 50% від вартості квитка;</p>
        <p>- менше ніж за 12 годин до від'їзду – 100 % вартості квитка.</p>
        <p>5.2.2. Кошти або частина Коштів, за умови вирахування обов’язкових утримань, при поверненні Квитка безпосередньо через Сайт, перераховуються Користувачу протягом 14 днів з моменту прийняття рішення про повернення коштів за Квиток.</p>
        <p>5.3. Процедура повернення квитка:</p>
        <p>5.3.1. Подача заявки на повернення коштів за квиток здійснюється в телефонному режимі за номерами, зазначеними у квитку. Повернення проводиться протягом 14 робочих днів.</p>
        <p>6. УМОВИ НАДАННЯ ІНФОРМАЦІЇ</p>
        <p>6.1. Для здійснення оформлення та придбання Квитка на Сайті необхідно надати певну інформацію, а саме: Ім’я і Прізвище пасажира, дату народження, діючу е-mail адресу та номер телефону.</p>
        <p>6.2. Також при покупці необхідно вказати платіжну інформацію, пов'язану з банківськими картками, тобто їх номери і терміни дії. Вводити дану інформацію необхідно при кожній купівлі на захищеному сервісі обраної платіжної системи.</p>
        <p>7. ГАРАНТІЇ СТОРІН</p>
        <p>7.1. Здійснюючи покупку через Сайт, Користувач підтверджує свою дієздатність та дає згоду на обробку своїх персональних даних.</p>
        <p>7.2. Агент зобов’язується не використовувати персональні дані Користувача для розсилки матеріалів, що не мають відношення до Послуг, які надаються Виконавецю, не передавати персональні дані третім особам та не використовувати їх з іншою метою.</p>
        <p>7.3. Користувач погоджуєтеся сплатити ціну Квитка і відповідні податки для всіх зроблених покупок, оплачених кредитними або дебітними картками, або іншим дозволеним методом оплати.</p>
        <p>7.4. Користувач погоджується сплатити всі визначені Виконавцем кошти у разі, якщо платіж не здійснено, повернуто або відхилено банком Корисувача.</p>
        <p>7.5. Виконавець, здійснюючи продаж Квитка за допомогою Сайту, підтверджує наявне у нього право на продаж даного Квитка, у відповідності до умов і обов’язків, визначених Перевізником.</p>
        <p>7.6. Виконавець зберігає за собою право на свій розсуд блокувати кредитні та дебетні картки за підозрілу активність.</p>
        <p>8. КОНФІДЕНЦІЙНА ІНФОРМАЦІЯ</p>
        <p>8.1. Користувач підтверджує згоду з тим, що несе особисту відповідальність за надану для збереження конфіденційну інформацію.</p>
        <p>8.2. Виконавець не несе відповідальності за будь-які збитки, завдані внаслідок несанкціонованого використання конфіденційної інформації, залишеної Користувачем.</p>
        <p>8.3. Вся особиста інформація, отримана Виконавцем в результаті здійснення замовлень через Сайт, зберігається згідно з чинним законодавством про конфіденційність.</p>
        <p>8.4. Виконавець залишає за собою право використовувати та розкривати інформацію про Користувача або про замовлення, здійсненні Користувачем, на умовах дотримання Конфіденційності.</p>
        <p>9. ЗГОДА НА ОБРОБКУ ПЕРСОНАЛЬНИХ ДАНИХ</p>
        <p>9.1. Користувач надає згоду та підтверджує, що дані, вказані ним при придбанні Квитка правдиві, і Користувач має право вказати їх при купівлі Квитка та залишити для подальшої обробки та збереження, у тому числі, але не обмежуючись, для:</p>
        <p>- передачі їх третій стороні, яка тим чи іншим чином пов’язана з цим Договором, або з метою його повного виконання;</p>
        <p>- додаткового інформування Користувача про статус виконання рейсу, зміни в його умовах; подальшої обробки замовлень Користувача;</p>
        <p>- отримання сервісних повідомлень, у тому числі щодо акцій, бонусних програм і знижок, що проводяться Виконавцем.</p>
        <p>10. ВІДПОВІДАЛЬНІСТЬ СТОРІ</p>
        <p>10.1. У разі невиконання або неналежного виконання однією із Сторін зобов’язань за Договором, винна Сторона зобов’язана відшкодувати протилежній Стороні заподіяні і доведені такими діями збитки.</p>
        <p>10.2. Користувач особисто несе відповідальність за дотримання умов і правил обраного Перевізника та Договору.</p>
        <p>УВАГА! Цей Договір регулює виключно умови придбання обраного Користувачем Квитка, який в свою чергу є свідченням укладення договору Перевезення.</p>
        <p>11. ЗВІЛЬНЕННЯ ВІД ВІДПОВІДАЛЬНОСТІ СТОРІН</p>
        <p>11.1. Користувач розуміє і погоджується з тим, що Виконавець не несе жодної відповідальності за будь-які прямі, непрямі, побічні та штрафні збитки; а також за незручності пов'язані з виконанням перевезення (у тому числі, але не обмежуючись, затримки рейсів, скасування рейсів, пропущені стикування рейсів) або інші можливі проблеми, що мали місце у зв'язку з Вашим відвідуванням або використанням Сайту.</p>
        <p>11.2. Виконавець не несе відповідальності за втрати і збитки, понесені Користувачем в процесі поїздок в різні точки світу.</p>
        <p>11.3. Користувач погоджується з тим, що отримує доступ до товарів і послуг, і інформації про автобусні перевезення, доступні на Сайті під свою відповідальність.</p>
        <p>11.4. Виконавець не несе відповідальності за збитки та/або втрату квитка на той чи інший вид транспорту, за збитки, отримані Користувачем в результаті запізнення автобусу до пункту, де Користувач мав здійснити пересадку, у тому числі придбаним одним замовленням через Сайт.</p>
        <p>12. ПРЕТЕНЗІЇ І ПІДСУДНІСТЬ</p>
        <p>12.1. Претензійний порядок розгляду звернень не є обов’язковим.</p>
        <p>12.2. При порушення умов Договору однією із Сторін, протилежна Сторона має право звернутись до суду. Місцезнаходження суду обирається у відповідності до чинного законодавства України.</p>
        <p>12.3. Усі питання щодо відносин між Сторонами, які не врегульовані цим Договором, регулюються чинним законодавством України.</p>
        <p>УВАГА! При порушення умов Договору перевезення, умови якого (дата, час відправлення/прибуття, місце посадки/висадки) наведені у Квитку, несе Перевізник, що фактично виконував рейс.</p>
        <p>13. ПРИКІНЦЕВІ ПОЛОЖЕННЯ</p>
        <p>13.1. Номер Договору відповідає номеру придбаного Користувачем Квитка. Датою укладення Договору є дата здійснення платежу, в рахунок обраного Квитка.</p>
        <p>14. РЕКВІЗИТИ СТОРІН</p>
        <p>14.1. Реквізити Виконавця:</p>
        <p>ФОП Станкова Лілія Сергіївна</p>
        <p>Код одержувача: 3188018428</p>
        <p>Назва банку: АТ КБ «ПриватБанк»</p>
        <p>Рахунок одержувача у форматі IBAN: UA953052990000026007024919399</p>
        <p>Тел. цілодобової диспетчерської служби:</p>
        <p>+38097-356-96-96</p>
        <p>E-mail: newtrans.comp@gmail.com</p>
        <p>14.2. Реквізити Пасажира: свої реквізити Замовник вносить за допомогою Інтернет-ресурсу https://newtrans.com.ua/ в реєстраційну електронну форму на етапі формування електронного квитка.</p>
      </div>
    </>
  )
}

PublicOfferPage.getLayout = function getLayout(page: ReactElement) {
  return <CommonLayout>{page}</CommonLayout>
}

export default PublicOfferPage
